podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/TRNG0_MK28F15.svd.xml
            <register>
               <name>VID1</name>
               <description>RNG Version ID Register (MS)</description>
               <addressOffset>0xF0</addressOffset>
               <access>read-only</access>
               <resetValue>0x300100</resetValue>
               <fields>
                  <field>
                     <name>RNG_MIN_REV</name>
                     <description>Shows the Freescale IP&apos;s Minor revision of the TRNG</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0x00</name>
                           <description>Minor revision number for TRNG</description>
                           <value>0b0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RNG_MAJ_REV</name>
                     <description>Shows the Freescale IP&apos;s Major revision of the TRNG</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0x01</name>
                           <description>Major revision number for TRNG</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RNG_IP_ID</name>
                     <description>Shows the Freescale IP ID</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>VID2</name>
               <description>RNG Version ID Register (LS)</description>
               <addressOffset>0xF4</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RNG_CONFIG_OPT</name>
                     <description>Shows the Freescale IP&apos;s Configuaration options for the TRNG</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0x00</name>
                           <description>TRNG_CONFIG_OPT for TRNG</description>
                           <value>0b0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RNG_ECO_REV</name>
                     <description>Shows the Freescale IP&apos;s ECO revision of the TRNG</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0x00</name>
                           <description>TRNG_ECO_REV for TRNG</description>
                           <value>0b0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RNG_INTG_OPT</name>
                     <description>Shows the Freescale integration options for the TRNG</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0x00</name>
                           <description>INTG_OPT for TRNG</description>
                           <value>0b0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RNG_ERA</name>
                     <description>Shows the Freescale compile options for the TRNG</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0x00</name>
                           <description>COMPILE_OPT for TRNG</description>
                           <value>0b0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
